app/views/lists/show.html.erb

  <div class="large-6 large-centered columns">
    <% unless @list.suggestions.empty? %>
---
SELECT  1 AS one FROM "suggestions" WHERE "suggestions"."list_id" = $1 LIMIT $2  [["list_id", 5], ["LIMIT", 1]]
SELECT "suggestions".* FROM "suggestions" WHERE "suggestions"."list_id" = $1  [["list_id", 5]]