app/views/home/show.html.erb

          <p>My RecoFriend Submissions</p>
      <% current_user.lists.each do |list| %>
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 1]]