app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE (title LIKE '%burgerception%' OR body LIKE '%burgerception%') ORDER BY created_at DESC
---
  def index
    @lists = List.all.order("created_at DESC")

INSERT INTO "lists" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "British Shows"], ["body", "I want to see a british comedy like the IT Crowd"], ["user_id", 1], ["created_at", 2017-05-04 17:55:50 UTC], ["updated_at", 2017-05-04 17:55:50 UTC]]
---
  def create
    @list = List.new(list_params)
    @list.user= current_user
    if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "lists" SET "body" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["body", "Does anyone have any cool recommendations similar to Breaking Bad? "], ["updated_at", 2017-05-09 17:41:01 UTC], ["id", 2]]
---
  def update
    @list = List.find(params[:id])
    @list.update_attributes(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 3]]
DELETE FROM "suggestions" WHERE "suggestions"."id" = $1  [["id", 4]]
---
  def destroy
      @list = List.find(params[:id])
      @list.suggestions.destroy_all