app/controllers/searches_controller.rb

  def index
    if params[:search] == ""
      @blank_message = "You have submitted a empty query"
    else
      @lists = List.search(params[:search])
---
SELECT "lists".* FROM "lists" WHERE (title LIKE '%Westworld%' OR body LIKE '%Westworld%')