app/controllers/shows_controller.rb

  def searchAPI
    if current_user.present?
     @shows = Show.all
     userinput = params[:userinput]
     userinput = userinput.split(' ').join('-')
     response = HTTParty.get("http://api-public.guidebox.com/v2/search?api_key=7b5cad93d7d43098874c81270fd414d8ff60fa9b&type=show&field=title&query=#{userinput}")
     json_response = JSON.parse(response.body)
     json_response["results"].each do |result|
       id = result["id"]
       show_details = HTTParty.get("http://api-public.guidebox.com/v2/shows/#{id}/available_content\?api_key\=7b5cad93d7d43098874c81270fd414d8ff60fa9b&limit=1")
       json_show_details = JSON.parse(show_details.body)
       Show.find_or_create_by!(title: result["title"]) do |show|
---
SELECT "shows".* FROM "shows"
INSERT INTO "shows" ("title", "image_url", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "shows".* FROM "shows" WHERE "shows"."title" = $1 LIMIT $2  [["title", "Seinfeld"], ["LIMIT", 1]]