app/controllers/suggestions_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
 def new
   if current_user.present?
     @list = List.find(params[:list_id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "suggestions" ("show_name", "description", "list_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
 def create
   @list = List.find(params[:list_id])
   @suggestion = Suggestion.new(suggestion_params)
   @suggestion.list = @list
   @suggestion.user = current_user
   list_owner = @list.user
   if @suggestion.save